# flipFacing Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..flipFacing Method
FamilyInstance Class See Also
---
The orientation of family instance facing will be flipped. If it can not be flipped, return false, otherwise return true.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool flipFacing()
```

Visual Basic
---
```text
Public Function flipFacing As Boolean
```

Visual C++
---
```text
public:
bool flipFacing()
```

# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace